import requests
params2 ={
  "key": "6617df78ec04efcba67789cc7e02895b",
  "paths": "5,0x008000,1,,0.5:116.39748,39.90882;116.403874,39.914885;115.41,39.52;117.41,39.12;113.41,39.02;119.41,39.52;118.41,39.42;117.0,39.3;116.0,39.2;115.0,39.1;114.0,39.0",
  "markers": "small,0xFF5733,0:116.39748,39.90882;116.403874,39.914885;115.41,39.52;117.41,39.12;113.41,39.02;119.41,39.52;118.41,39.42;117.0,39.3;116.0,39.2;115.0,39.1;114.0,39.0;110.39748,34.90882",
  "labels": "地点1,0,1,12,0x000000,0xFFFF00:116.39748,39.90882|地点2,0,1,12,0x000000,0xFFFF00:116.403874,39.914885|地点3,0,1,12,0x000000,0xFFFF00:115.41,39.52|地点4,0,1,12,0x000000,0xFFFF00:117.41,39.12|地点5,0,1,12,0x000000,0xFFFF00:113.41,39.02|地点6,0,1,12,0x000000,0xFFFF00:119.41,39.52|地点7,0,1,12,0x000000,0xFFFF00:118.41,39.42|地点8,0,1,12,0x000000,0xFFFF00:117.0,39.3|地点9,0,1,12,0x000000,0xFFFF00:116.0,39.2|地点10,0,1,12,0x000000,0xFFFF00:115.0,39.1",
  "size": "800*600",
  "scale": 1
}
url2 = "https://restapi.amap.com/v3/staticmap"
response = requests.get(url2, params=params2)
print(response.headers.get("Content-Type", ""))
if "image" not in response.headers.get("Content-Type", ""):
    print(f"API返回错误：{response.text}")
else:
    with open("use_GaoDe_api/test_api.png", "wb") as f:
        f.write(response.content)